In [53]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
  "Accessories": ["Laptop", np.nan, "Ipad", "Ipad", np.nan, "Laptop"],
  "customer": ["Andrew", np.nan, "Tom", "Andrew", np.nan, "Peter"],
  "quantity": [1, 3, 2, 3, 4, 2],
})

In [48]:
df["customer"].fillna("Anon", inplace=True)

In [51]:
df['quantity'].median()

2.0

In [49]:
df

  Accessories customer  quantity
0      Laptop   Andrew       1.0
1         NaN     Anon       NaN
2        Ipad      Tom       2.0
3        Ipad   Andrew       3.0
4         NaN     Anon       NaN
5      Laptop    Peter       2.0

In [54]:
df['customer'], df['quantity'] = df['customer'].astype('str'), df['quantity'].astype('int64')

In [55]:
df

  Accessories customer  quantity
0      Laptop   Andrew         1
1         NaN      nan         3
2        Ipad      Tom         2
3        Ipad   Andrew         3
4         NaN      nan         4
5      Laptop    Peter         2

In [22]:
df.groupby(['Accessories', 'customer']).quantity.sum()

Accessories  customer
Ipad         Andrew      3.0
             Tom         2.0
Laptop       Andrew      1.0
             Peter       2.0
Tablet       Tobey       1.0
Name: quantity, dtype: float64

In [27]:
list(df.iloc[1])

[nan, nan, nan]

In [28]:
def is_null(x): 
        return sum(x.isnull())

In [43]:
print(len(df.iloc[0]))
null_sum = list(df.apply(lambda x:sum(x.isnull()), axis=1))

3

In [44]:
for i in range(len(null_sum)):
    if null_sum[i]==len(df.iloc[0]):
        df.drop([i], inplace=True)

In [45]:
df

  Accessories customer  quantity
0      Laptop   Andrew       1.0
2        Ipad      Tom       2.0
3        Ipad   Andrew       3.0
5      Laptop    Peter       2.0